; domain
(define (domain instance_4-domain)
 (:requirements :strips :typing :numeric-fluents)
 (:types counter)
 (:predicates  (dummy-predicate))
 (:functions (value ?c - counter) (max_int))
 (:action increment
  :parameters ( ?c - counter)
  :precondition (and (<= (+ 1 (value ?c)) (max_int)))
  :effect (and (increase (value ?c) 1)))
 (:action decrement
  :parameters ( ?c - counter)
  :precondition (and (<= 1 (value ?c)))
  :effect (and (decrease (value ?c) 1)))
)

; problem
(define (problem instance_4-problem)
 (:domain instance_4-domain)
 (:objects
   c0 c1 c2 c3 - counter
 )
 (:init (= (max_int) 8) (= (value c0) 6) (= (value c1) 4) (= (value c2) 2) (= (value c3) 0))
 (:goal (and (<= (+ 1 (value c0)) (value c1)) (<= (+ 1 (value c1)) (value c2)) (<= (+ 1 (value c2)) (value c3))))
)

; plan
1. (increment c3)
   changed: (value c3) from 0 to 1
   goals met: 0 of 3
2. (increment c3)
   changed: (value c3) from 1 to 2
   goals met: 0 of 3
3. (increment c3)
   changed: (value c3) from 2 to 3
   goals met: 1 of 3
4. (decrement c0)
   changed: (value c0) from 6 to 5
   goals met: 1 of 3
5. (decrement c0)
   changed: (value c0) from 5 to 4
   goals met: 1 of 3
6. (decrement c0)
   changed: (value c0) from 4 to 3
   goals met: 2 of 3
7. (increment c2)
   changed: (value c2) from 2 to 3
   goals met: 1 of 3
8. (increment c3)
   changed: (value c3) from 3 to 4
   goals met: 2 of 3
9. (increment c2)
   changed: (value c2) from 3 to 4
   goals met: 1 of 3
10. (increment c3)
   changed: (value c3) from 4 to 5
   goals met: 2 of 3
11. (increment c2)
   changed: (value c2) from 4 to 5
   goals met: 2 of 3
12. (increment c3)
   changed: (value c3) from 5 to 6
   goals met: 3 of 3
